export const DISCLAIMER = {
  TITEL: '免責事項',
  DESCRIPTION:
    '高卒Devlog(https://kosotudev.com)(以下、「当ブログ」とします。)における、免責事項は下記の通りです。',
  COMMENT: {
    TITLE: 'コメントについて',
    CONTENT:
      '次の各号に掲げる内容を含むコメントは、当ブログ管理人の裁量によって承認せず、削除する事があります。',
    LIST: [
      '特定の自然人または法人を誹謗し、中傷するもの',
      '極度にわいせつな内容を含むもの',
      '禁制品の取引に関するものや、他者を害する行為の依頼など、法律によって禁止されている物品、行為の依頼や斡旋などに関するもの',
      'その他、公序良俗に反し、または管理人によって承認すべきでないと認められるもの',
    ],
  },
  INFORMATION: {
    TITLE: '当サイトの情報について',
    CONTENT:
      '当ブログのコンテンツはできる限り正確な情報を提供するように努めておりますが、正確性や安全性を保証するものではありません。情報が古くなっている場合もございます。',
  },
  RESPONSIBILITY: {
    TITLE: '損害等の責任について',
    CONTENT:
      '当ブログに掲載された内容によって生じた損害等の一切の責任を負いかねますのでご了承ください。当ブログからリンクやバナーなどによって他のサイトに移動された場合、移動先で提供される情報およびサービス等について一切の責任を負いません。',
  },
  COPYRIGHT: {
    TITLE: '著作権・肖像権について',
    CONTENT:
      '当サイトで掲載している画像の著作権や肖像権等は、各権利所有者に帰属します。',
  },
  REPRINT: {
    TITLE: '無断転載の禁止について',
    CONTENT:
      '当サイトに存在する、文章や画像、動画等の著作物の情報を無断転載することを禁止します。引用の範囲を超えるものについては、法的処置を行います。',
  },
  LIST: {
    POINTER: '・',
  },
} as const

export const ARIA_LABEL = {
  DISCLAIMER_DETAIL: 'disclaimerDetail',
} as const
